app/controllers/pins_controller.rb

  def edit
    @pin = current_user.pins.find(params[:id])
---
SELECT "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @pin = current_user.pins.new(params[:id])

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 27 Jul 2013 15:50:36 UTC +00:00], ["description", "Pin!"], ["updated_at", Sat, 27 Jul 2013 15:50:36 UTC +00:00]]